luantty2/nRF52840-instruction/源码/candy_ble/encoder.c
/*
 * Copyright 2018 Jack Humbert <jack.humb@gmail.com>
 *
 * This program is free software: you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation, either version 2 of the License, or
 * (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program.  If not, see <http://www.gnu.org/licenses/>.
 */
#include QMK_KEYBOARD_H
#include "encoder.h"
#ifdef SPLIT_KEYBOARD
#    include "split_util.h"
#endif
#include "nrf_gpio.h"
#include "nrf_delay.h"

// for memcpy
#include <string.h>

#ifndef ENCODER_RESOLUTION
#    define ENCODER_RESOLUTION 2
#endif

#if !defined(ENCODERS_PAD_A) || !defined(ENCODERS_PAD_B)
#    error "No encoder pads defined by ENCODERS_PAD_A and ENCODERS_PAD_B"
#endif

#define NUMBER_OF_ENCODERS 1
static uint8_t encoders_pad_a[] = ENCODERS_PAD_A;
static uint8_t encoders_pad_b[] = ENCODERS_PAD_B;

static int8_t encoder_LUT[] = {0, -1, 1, 0, 1, 0, 0, -1, -1, 0, 0, 1, 0, 1, -1, 0};

static uint8_t encoder_state[NUMBER_OF_ENCODERS] = {0};

#ifdef SPLIT_KEYBOARD
// right half encoders come over as second set of encoders
static int8_t encoder_value[NUMBER_OF_ENCODERS * 2] = {0};
// row offsets for each hand
static uint8_t thisHand, thatHand;
#else
static int8_t encoder_value[NUMBER_OF_ENCODERS] = {0};
#endif

// void tap_code(uint8_t code) {
//     register_code(code);
//     // if (code == KC_CAPS) {
//     //     wait_ms(TAP_HOLD_CAPS_DELAY);
//     // } else {
//         wait_ms(10);
//     // }
//     unregister_code(code);
// }

__attribute__((weak)) void encoder_update_user(int8_t index, bool clockwise) 
{ 
    // if(index==0)
    // {
    // if(clockwise){
    //         // send_string("+");
    //     register_code(KC_A);
    //     //// wait_ms(20);
    //     nrf_delay_ms(10);
    //     unregister_code(KC_A);
    //     // send_string(_tap(KC_A));

    //     // tap_code(KC_VOLU);
    //     }
    //     else{
    //         // send_string("=");
    //         // tap_code(KC_B);
    //         register_code(KC_B);
    //         // wait_ms(50);
    //         nrf_delay_ms(10);
    //         unregister_code(KC_B);
    //     }
    // }
    
}

__attribute__((weak)) void encoder_update_kb(int8_t index, bool clockwise) { encoder_update_user(index, clockwise); }

void encoder_init(void) {
#if defined(SPLIT_KEYBOARD) && defined(ENCODERS_PAD_A_RIGHT) && defined(ENCODERS_PAD_B_RIGHT)
    if (!isLeftHand) {
        const pin_t encoders_pad_a_right[] = ENCODERS_PAD_A_RIGHT;
        const pin_t encoders_pad_b_right[] = ENCODERS_PAD_B_RIGHT;
        for (uint8_t i = 0; i < NUMBER_OF_ENCODERS; i++) {
            encoders_pad_a[i] = encoders_pad_a_right[i];
            encoders_pad_b[i] = encoders_pad_b_right[i];
        }
    }
#endif

    for (int i = 0; i < NUMBER_OF_ENCODERS; i++) {
        nrf_gpio_cfg_input(encoders_pad_a[i],NRF_GPIO_PIN_PULLUP);
        nrf_gpio_cfg_input(encoders_pad_b[i],NRF_GPIO_PIN_PULLUP);

        encoder_state[i] = (nrf_gpio_pin_read(encoders_pad_a[i]) << 0) | (nrf_gpio_pin_read(encoders_pad_b[i]) << 1);
    }

#ifdef SPLIT_KEYBOARD
    thisHand = isLeftHand ? 0 : NUMBER_OF_ENCODERS;
    thatHand = NUMBER_OF_ENCODERS - thisHand;
#endif
}

static void encoder_update(int8_t index, uint8_t state) {
    encoder_value[index] += encoder_LUT[state & 0xF];
    if (encoder_value[index] >= ENCODER_RESOLUTION) {
        encoder_update_kb(index, false);
    }
    if (encoder_value[index] <= -ENCODER_RESOLUTION) { // direction is arbitrary here, but this clockwise
        encoder_update_kb(index, true);
    }
    encoder_value[index] %= ENCODER_RESOLUTION;
}

void encoder_read(void) {
    for (int i = 0; i < NUMBER_OF_ENCODERS; i++) {
        encoder_state[i] <<= 2;
        encoder_state[i] |= (nrf_gpio_pin_read(encoders_pad_a[i]) << 0) | (nrf_gpio_pin_read(encoders_pad_b[i]) << 1);
#if SPLIT_KEYBOARD
        encoder_update(i + thisHand, encoder_state[i]);
#else
        encoder_update(i, encoder_state[i]);
#endif
    }
}

#ifdef SPLIT_KEYBOARD
void encoder_state_raw(uint8_t* slave_state) { memcpy(slave_state, encoder_state, sizeof(encoder_state)); }

void encoder_update_raw(uint8_t* slave_state) {
    for (int i = 0; i < NUMBER_OF_ENCODERS; i++) {
        encoder_update(i + thatHand, slave_state[i]);
    }
}
#endif